{
    "AA": [
        {
            "acronym": "AA",
            "meaning": "Algoritmos Avançados é uma disciplina optativa do curso de Ciência da Computação na UFCG com foco em olimpíadas/maratonas de programação, mas também é procurada por alunos que desejam se preparar para entrevistas de emprego. Existem subcategorias de AA para se adequar ao conhecimento de cada aluno, pois envolve conteúdos de Teoria dos Grafos, EDA, MSN e ATAL.",
            "type": "Disciplina",
            "entry": "Algoritmos Avançados",
            "examples": [
                "Olha só a galera do AA ali.",
                "Vai ter AA hoje ou é acompanhamento?",
                "Hoje eu vi programação dinâmica no AA, mas não entendi nada."
            ]
        }
    ],
    "AD1": [
        {
            "acronym": "AD1",
            "meaning": "Análise de Dados 1. Equivale a CDD no PPC atual.",
            "type": "Disciplina",
            "entry": "Análise de Dados 1",
            "examples": [
                "Eu tou pagando AD1 agora, tá muito massa!",
                "As atividades de AD1 tomam muito tempo, mas vc acaba aprendendo muito"
            ]
        }
    ],
    "AD2": [
        {
            "acronym": "AD2",
            "meaning": "Análise de Dados 2. Equivale a CDP no PPC atual.",
            "type": "Disciplina",
            "entry": "Análise de Dados 2",
            "examples": [
                "Eu tou pagando AD2 agora, que é CDP na grade nova",
                "Em AD2 é que a gente aprende o básico de Machine Learning na prática"
            ]
        }
    ],
    "ADSD": [
        {
            "acronym": "ADSD",
            "meaning": "Avaliação de Desempenho de Sistemas Discretos",
            "type": "Disciplina",
            "entry": "Avaliação de Desempenho de Sistemas Discretos",
            "examples": []
        }
    ],
    "AS": [
        {
            "acronym": "AS",
            "meaning": "Análise de Sistemas é uma disciplina obrigatória do 5º período de Ciência da Computação na UFCG com foco nas metodologias, processos e artefatos utilizados na computação para o desenvolvimento de um sistema de software.",
            "type": "Disciplina",
            "entry": "Análise de Sistemas",
            "examples": [
                "Hoje aprendi como se faz um diagrama de classe em AS.",
                "AS é uma cadeira legal de ser paga com Engenharia de Software."
            ]
        }
    ],
    "ATAL": [
        {
            "acronym": "ATAL",
            "meaning": "Análise e Técnicas de Algoritmos",
            "type": "Disciplina",
            "entry": "Análise e Técnicas de Algoritmos",
            "examples": []
        }
    ],
    "BD": [
        {
            "acronym": "BD",
            "meaning": "Banco de Dados I é uma disciplina obrigatória do 4º período de Ciência da Computação na UFCG com foco em persistência de dados utilizando linguagem estruturada de consulta.",
            "type": "Disciplina",
            "entry": "Banco de Dados I",
            "examples": [
                "Me falaram que BD tem geralmente duas turmas.",
                "Em BD a gente só aprende teoria, ou usa SQL também?",
                "BD foi horrível no meu período."
            ]
        }
    ],
    "BD2": [
        {
            "acronym": "BD2",
            "meaning": "Banco de Dados II",
            "type": "Disciplina",
            "entry": "Banco de Dados II",
            "examples": []
        }
    ],
    "CDD": [
        {
            "acronym": "CDD",
            "meaning": "Ciência de Dados Descritiva",
            "type": "Disciplina",
            "entry": "Ciência de Dados Descritiva",
            "examples": []
        }
    ],
    "CDP": [
        {
            "acronym": "CDP",
            "meaning": "Ciência de Dados Preditiva é uma disciplina optativa do curso de Ciência da Computação na UFCG com foco em algoritmos e técnicas de IA para a predição de valores a partir de dados prévios.",
            "type": "Disciplina",
            "entry": "Ciência de Dados Preditiva",
            "examples": [
                "CDP envolve muito Cálculo.",
                "Hoje teve quiz em CDP?",
                "Passei o final de semana treinando os classificadores pro lab de CDP."
            ]
        }
    ],
    "CG": [
        {
            "acronym": "CG",
            "meaning": "Computação Gráfica",
            "type": "Disciplina",
            "entry": "Computação Gráfica",
            "examples": []
        }
    ],
    "DACA": [
        {
            "acronym": "DACA",
            "meaning": "Desenvolvimento de Aplicações Corporativas Avançadas",
            "type": "Disciplina",
            "entry": "Desenvolvimento de Aplicações Corporativas Avançadas",
            "examples": []
        }
    ],
    "EDA": [
        {
            "acronym": "EDA",
            "meaning": "Estrutura de Dados é uma disciplina obrigatória do 3º período do curso de Ciência de Computação na UFCG que visa o estudo de complexidade de algoritmos, métodos de ordenação e estruturas de dados.",
            "type": "Disciplina",
            "entry": "Estrutura de Dados",
            "examples": [
                "Essa prova de EDA estava muito fácil.",
                "Vocês viram o resumo de EDA no Tamburetei? É muito bom!"
            ]
        }
    ],
    "ES": [
        {
            "acronym": "ES",
            "meaning": "Engenharia de Software é uma disciplina obrigatória do 5º período do curso de Ciência da Computação na UFCG na qual são estudadas práticas de gerência de projetos voltados à especificação, desenvolvimento e manutenção de software.",
            "type": "Disciplina",
            "entry": "Engenharia de Software",
            "examples": [
                "Eu hoje sou uma nova pessoa depois que aprendi a usar o GTD em ES",
                "Nossa, eu não consegui organizar o grupo de PLP que era só 5 pessoas, imagine o de ES que são 10...",
                "Ah ES nem é uma cadeira tão difícil assim, só toma um pouco de tempo"
            ]
        }
    ],
    "ETI": [
        {
            "acronym": "ETI",
            "meaning": "Economia de Tecnologia da Informação",
            "type": "Disciplina",
            "entry": "Economia de Tecnologia da Informação",
            "examples": []
        }
    ],
    "FMCC1": [
        {
            "acronym": "FMCC1",
            "meaning": "Fundamentos de Matemática para Ciência da Computação I é uma disciplina obrigatória do 1º período do curso de Ciência da Computação na UFCG que visa estudar conceitos matemáticos básicos que serão usados por todo o curso.",
            "type": "Disciplina",
            "entry": "Fundamentos de Matemática para Ciência da Computação I",
            "examples": [
                "Amanhã tem aula de FMCC1.",
                "A prova de FMCC1 tava muito ruim."
            ]
        }
    ],
    "FMCC2": [
        {
            "acronym": "FMCC2",
            "meaning": "Fundamentos de Matemática para Ciência da Computação II é uma disciplina obrigatória do 2º período do curso de Ciência da Computação na UFCG que visa o estudo de um conjunto de ferramentas matemáticas essenciais para Computação",
            "type": "Disciplina",
            "entry": "Fundamentos de Matemática para Ciência da Computação II",
            "examples": [
                "Vocês fizeram o mini teste de FMCC2?",
                "Essa aula de FMCC2 foi muito boa!"
            ]
        }
    ],
    "GR": [
        {
            "acronym": "GR",
            "meaning": "Gerência de Redes",
            "type": "Disciplina",
            "entry": "Gerência de Redes",
            "examples": []
        }
    ],
    "IA": [
        {
            "acronym": "IA",
            "meaning": "Inteligência Artificial é uma disciplina obrigatória do 6º período de Ciência da Computação na UFCG com foco no estudo das principais técnicas de inteligência artificial, dentre elas: machine learning, PLN, robótica e visão computacional.",
            "type": "Disciplina",
            "entry": "Inteligência Artificial",
            "examples": [
                "IA casa muito bem com CDP.",
                "A aula de IA hoje teve lógica fuzzy. Saudades lógica!",
                "Usei regressão linear no projeto de IA."
            ]
        }
    ],
    "IC": [
        {
            "acronym": "IC",
            "meaning": "Introdução à Computação é uma disciplina obrigatória do 1º período de Ciência da Computação na UFCG que tem como foco mostrar uma visão geral do curso de Ciência da Computação, assim como ensinar conceitos básicos de Hardware e Software.",
            "type": "Disciplina",
            "entry": "Introdução à Computação",
            "examples": [
                "A aula de IC hoje foi muito massa.",
                "Os resumos de IC do Tamburetei são muito bons."
            ]
        }
    ],
    "IRC": [
        {
            "acronym": "IRC",
            "meaning": "Interconexão e Redes de Computadores",
            "type": "Disciplina",
            "entry": "Interconexão e Redes de Computadores",
            "examples": []
        }
    ],
    "JoDi": [
        {
            "acronym": "JoDi",
            "meaning": "Jogos Digitais",
            "type": "Disciplina",
            "entry": "Jogos Digitais",
            "examples": []
        }
    ],
    "LEDA": [
        {
            "acronym": "LEDA",
            "entry": "Laboratório de Estrutura de Dados",
            "type": "Disciplina",
            "meaning": "Laboratório de Estrutura de Dados é uma disciplina obrigatória do 3º período do curso de Ciência de Computação que é paga em conjunto com EDA para o aprofundamento prático dos assuntos vistos em EDA.",
            "examples": [
                "Essa prova de LEDA eu só segurei na mão de Thanos e fui.",
                "O roteiro de LEDA dessa semana é uma viagem!"
            ]
        }
    ],
    "LES": [
        {
            "acronym": "LES",
            "meaning": "Laboratório de Engenharia de Software. Foi substituida no PPC atual por VVS e GP.",
            "type": "Disciplina",
            "entry": "Laboratório de Engenharia de Software",
            "examples": [
                "Gestão de Projetos é parecida com LES?"
            ]
        }
    ],
    "LIRC": [
        {
            "acronym": "LIRC",
            "meaning": "Laboratório de Interconexão e Redes de Computadores. Foi incluída em IRC no PPC atual, que passou a ser uma disciplina de 4 créditos.",
            "type": "Disciplina",
            "entry": "Laboratório de Interconexão e Redes de Computadores",
            "examples": [
                "LIRC e IRC agora são uma disciplina só, né?"
            ]
        }
    ],
    "LOAC": [
        {
            "acronym": "LOAC",
            "meaning": "Laboratório de Organização e Arquitetura de Computadores é uma disciplina obrigatória do 4º período de Ciência da Computação na UFCG que visa o estudo da arquitetura e funcionamento dos componentes presentes em computadores de uma forma prática, tendo grande foco em como projetar e programar um processador. A disciplina conta com experimentos avaliativos práticos a cada aula.",
            "type": "Disciplina",
            "entry": "Laboratório de Organização e Arquitetura de Computadores",
            "examples": [
                "LOAC é peso",
                "O LCC3 tá cheio de fio pelas mesas da aula de LOAC",
                "Estudei nada ainda pra prova do fim do mundo de LOAC amanhã"
            ]
        }
    ],
    "LP1": [
        {
            "acronym": "LP1",
            "meaning": "Laboratório de Programação 1 é uma disciplina obrigatória do 1º período de Ciência da Computação na UFCG que é paga em conjunto com P1 e visa a ensinar aplicação prática dos assuntos teórios de P1.",
            "type": "Disciplina",
            "entry": "Laboratório de Programação 1",
            "examples": [
                "Esse mini teste de LP1 tava bom demais.",
                "Nem passei de unidade no miniteste de LP1, hoje :("
            ]
        }
    ],
    "LP2": [
        {
            "acronym": "LP2",
            "meaning": "Laboratório de Programação 2 é a disciplina obrigatória do 2º período do curso Ciência da Computação na UFCG na qual colocamos em prática o que aprendemos na disciplina Programação 2, cujo foco está em programação orientada ao objeto, através de Labs, Quizzes e Provas.",
            "type": "Disciplina",
            "entry": "Laboratório de Programação 2",
            "examples": [
                "Quando começa o próximo lab de LP2?",
                "Preciso terminar o terceiro lab de LP2",
                "Eu não sei se era melhor usar herança ou interface na prova de LP2"
            ]
        }
    ],
    "MSN": [
        {
            "acronym": "MSN",
            "meaning": "Métodos e Softwares Numéricos é uma disciplina optativa do curso Ciência da Computação na UFCG inspirada em Cálculo Numérico, mas voltada para Ciência da Computação. Os principais conceitos abordados são: cálculo de erro, encontrar o zero de funções, ajustar um polinômio entre pontos e calcular integrais. A matéria era obrigatória no plano de curso pré 2018.1.",
            "type": "Disciplina",
            "entry": "Métodos e Softwares Numéricos",
            "examples": [
                "Acho que vou pagar MSN pra completar minhas horas complementares.",
                "Ei, você já pagou MSN? Coloquei na matrícula, mas estou com medo da matéria.",
                "Socorro, onde eu encontro leites de MSN?"
            ]
        }
    ],
    "OAC": [
        {
            "acronym": "OAC",
            "meaning": "Organização e Arquitetura de Computadores é uma discilina obrigatória do 4º período do curso Ciência da Computação na UFCG na qual aprendemos como é a arquitetura de um computador internamente e como funcionam seus componentes. Ela apresenta diversos conceitos teóricos sobre hardware, com ênfase nos elementos que compoem a placa-mãe, sua evolução ao longo de tempo e como funcionam.",
            "type": "Disciplina",
            "entry": "Organização e Arquitetura de Computadores",
            "examples": [
                "Aprendi como funciona um processador em OAC, muito massa!",
                "A atividade de OAC tem que ser entregue até sexta",
                "Consegui subir meu CRA com as atividades extras de OAC",
                "Queria que o conteúdo de OAC fosse mais próximo do que a gente faz em LOAC..."
            ]
        }
    ],
    "P1": [
        {
            "acronym": "P1",
            "meaning": "Programação 1 é uma disciplina obrigatória do 1º período de Ciência da Computação na UFCG que visa ensinar conceitos básicos de programação que serão a base para todo o curso.",
            "type": "Disciplina",
            "entry": "Programação 1",
            "examples": [
                "Amanhã vai ter aula de P1.",
                "Fui tirar uma dúvida de P1 e o professor mandou eu perguntar ao shell do python."
            ]
        },
        {
            "acronym": "P1",
            "meaning": "Projeto 1",
            "type": "Disciplina",
            "entry": "Projeto 1",
            "examples": []
        }
    ],
    "P2": [
        {
            "acronym": "P2",
            "meaning": "Programação 2 é uma disciplina obrigatória do 2º período de Ciência da Computação na UFCG que visa ensinar conceitos de programação orientada a objeto. ",
            "type": "Disciplina",
            "entry": "Programação 2",
            "examples": [
                "A prova de P2 estava muito boa.",
                "Amanhã vai ter aula de P2."
            ]
        },
        {
            "acronym": "P2",
            "meaning": "Projeto 2",
            "type": "Disciplina",
            "entry": "Projeto 2",
            "examples": []
        }
    ],
    "PC": [
        {
            "acronym": "PC",
            "meaning": "Programação Concorrente",
            "type": "Disciplina",
            "entry": "Programação Concorrente",
            "examples": []
        }
    ],
    "PLP": [
        {
            "acronym": "PLP",
            "meaning": "Paradigmas de Linguagem de Programação é uma disciplina obrigatória do 4º período de Ciência da Computação na UFCG que tem como foco estudar conceitos de linguagens de programação e os principais paradigmas que dão origem a diferentes estilos de programação.",
            "type": "Disciplina",
            "entry": "Paradigmas de Linguagem de Programação",
            "examples": [
                "Meu Deus a gente vai ter que aprender três linguagens em PLP",
                "Essa prática de PLP foi mamão com açúcar."
            ]
        }
    ],
    "SAD": [
        {
            "acronym": "SAD",
            "meaning": "Sistemas de Apoio à Decisão",
            "type": "Disciplina",
            "entry": "Sistemas de Apoio à Decisão",
            "examples": []
        }
    ],
    "SI1": [
        {
            "acronym": "SI1",
            "meaning": "Sistemas de Informação 1. Equivale a PSoft no PPC atual.",
            "type": "Disciplina",
            "entry": "Sistemas de Informação 1",
            "examples": [
                "É em SI 1 que a gente começa a mexer com Web?",
                "Passei um tempão aprendendo a usar Angular.js pro Lab de SI"
            ]
        }
    ],
    "SI2": [
        {
            "acronym": "SI2",
            "meaning": "Sistemas de Informação 2. Equivale a AS no PPC atual.",
            "type": "Disciplina",
            "entry": "Sistemas de Informação 2",
            "examples": [
                "Em SI 2 que vê bem direitinho aquelas coisas de UML, né?",
                "No período que tu pagou SI 2, vocês estudaram conversão de diagrama em texto?"
            ]
        }
    ],
    "SO": [
        {
            "acronym": "SO",
            "meaning": "Sistemas Operacionais",
            "type": "Disciplina",
            "entry": "Sistemas Operacionais",
            "examples": []
        }
    ],
    "TC": [
        {
            "acronym": "TC",
            "meaning": "Teoria da Computação é uma disciplina obrigatória do 5º período de Ciência da Computação. Nela, são vistos os conceitos de máquina de estados, expresões regulares, autômatos finitos, autômatos de pilha e máquina de Turing. Aborda a Ciência da Computação no mais alto nível teórico.",
            "type": "Disciplina",
            "entry": "Teoria da Computação",
            "examples": [
                "Demorei bastante pra aprender o problema da parada, em TC.",
                "Até hoje me confundo na hora de fazer Regex, e olha que a gente estudou em TC."
            ]
        }
    ],
    "TCC": [
        {
            "acronym": "TCC",
            "meaning": "Trabalho de Conclusão de Curso",
            "type": "Disciplina",
            "entry": "Trabalho de Conclusão de Curso",
            "examples": []
        }
    ],
    "TG": [
        {
            "acronym": "TG",
            "meaning": "Teoria dos Grafos é uma disciplina obrigatória do 3º período de Ciência da Computação na UFCG que visa o estudo de problemas representados por grafos, assim como algoritmos conhecidos na teoria dos grafos.",
            "type": "Disciplina",
            "entry": "Teoria dos Grafos",
            "examples": [
                "Só existe vídeo de indiano explicando esse assunto de TG",
                "Essa prática de TG estava muito boa."
            ]
        }
    ],
    "VC": [
        {
            "acronym": "VC",
            "meaning": "Visão Computacional",
            "type": "Disciplina",
            "entry": "Visão Computacional",
            "examples": []
        }
    ],
    "VVS": [
        {
            "acronym": "VVS",
            "meaning": "Verificação e Validação de Software é uma disciplina optativa do curso de Ciência da Computação na UFCG que visa o estudo de técnicas de teste e validação de software a fim de melhorar a qualidade e a manutenção do sistema.",
            "type": "Disciplina",
            "entry": "Verificação e Validação de Software",
            "examples": [
                "Essa semana tem quiz de VVS",
                "O projeto de VVS é pra amanhã",
                "Nossa, vi em VVS que fazer testes faz muita diferença!"
            ]
        }
    ]
}
