{
    "BOLA": [
        {
            "meaning": "Fera -> Ex-fera -> Esfera -> Bola. Bola é uma gíria usada para se referir aos estudantes que saíram do primeiro período, ou seja, não são mais feras.",
            "type": "Gíria",
            "entry": "Bola",
            "examples": [
                "Vindo de short, sandália, só com a caneta pra universidade? Certeza que é bola",
                "Ah, deixei de ser fera, sou bola agora"
            ]
        }
    ],
    "CADEIRA": [
        {
            "meaning": "Cadeira é uma gíria usada por alunos e professores para se referir às disciplinas.",
            "type": "Gíria",
            "entry": "Cadeira",
            "examples": [
                "Em quais cadeiras tu vai se matricular esse período?",
                "Me matriculei em 8 cadeiras esse período, vamo ver no que dá"
            ]
        }
    ],
    "FERA": [
        {
            "meaning": "Fera é uma gíria usada para se referir aos estudantes que acabaram de entrar na universidade e estão no primeiro período do curso.",
            "type": "Gíria",
            "entry": "Fera",
            "examples": [
                "Tá sorrindo por aí? Só pode ser fera",
                "Esse negócio de ficar andando em bando é coisa de fera",
                "Sejam todos amigáveis com os feras!"
            ]
        }
    ],
    "LEITE": [
        {
            "meaning": "Leites são provas de períodos passados de uma disciplina. Muitos alunos usam para estudar para a prova pois muitas vezes a prova possui questões semelhantes às dos períodos anteriores. Inclusive, dá uma olhada lá no Tamburetei que tem alguns disponíveis!",
            "type": "Gíria",
            "entry": "Leite",
            "examples": [
                "Lá em Genilda tem leite de cálculo",
                "Eita, caiu na prova as mesmas questões do leite!"
            ]
        }
    ],
    "PAGAR": [
        {
            "meaning": "Pagar é uma gíria usada na universidade que pode estar relacionada a se matricular em uma disciplina e também pode ser usada para dizer que foi aprovado em alguma disciplina.",
            "type": "Gíria",
            "entry": "Pagar",
            "examples": [
                "Quais disciplinas tu vai pagar esse período?",
                "Paguei cálculo com 10!!!",
                "Não paguei Linear de primeira, reprovei por causa de meio ponto"
            ]
        }
    ],
    "PIJAMA": [
        {
            "meaning": "Além de roupa de dormir, pijama é a relação de disciplinas ofertadas naquele período, contendo os professores e horários de cada disciplina.",
            "type": "Gíria",
            "entry": "Pijama",
            "examples": [
                "Corram, a coordenação mandou o pijama no email do CCC",
                "Eita, vi no pijama que abriu um monte de optativa esse período"
            ]
        }
    ],
    "RASGAR": [
        {
            "meaning": "Rasgar é um verbo usado por alunos da universidade para dizer que algo foi muito fácil, ou que se saiu muito bem em algo. Geralmente aplicado a provas ou disciplinas.",
            "type": "Gíria",
            "entry": "Rasgar",
            "examples": [
                "A prova de Cálculo foi rasgada",
                "Rasguei Estatística esse período"
            ]
        }
    ],
    "TAMBURETE": [
        {
            "meaning": "Tamburete é uma gíria usada para se referir a cadeiras na qual os alunos tem pouca dificuldade.",
            "type": "Gíria",
            "entry": "Tamburete",
            "examples": [
                "Aquela disciplina né uma cadeira não, é um tamburete",
                "Venha fazer de tamburete as cadeiras de CC com o Tamburetei!"
            ]
        }
    ]
}
