{
    "AMARELINHA": [
        {
            "meaning": "A Xerox Amarelinha é uma gráfica que fica próxima ao coreto por trás do CAA, vizinha à lanchonete de Joab. É um lugar muito frequentado por estudantes de Ciência da Computação e outros cursos que se localizam no setor de exatas, quando querem imprimir ou tirar xerox de algum documento.",
            "type": "Gráfica",
            "entry": "Xerox Amarelinha",
            "examples": [
                "Me encontra lá perto da amarelinha.",
                "Vou tirar xerox do resumo lá na amarelinha."
            ],
            "location": {
                "latitude": -7.21401,
                "longitude": -35.90765
            }
        }
    ],
    "CAA": [
        {
            "meaning": "CAA é um dos principais blocos de aula do setor de exatas. O CAA fica localizado em frente à biblioteca e normalmente você encontra pessoas de diferentes cursos no CAA.",
            "type": "Bloco",
            "entry": "CAA",
            "examples": [
                "As aulas de Probabilidade esse semestre são no CAA 408.",
                "Te encontro perto dos elevadores do CAA."
            ],
            "location": {
                "latitude": -7.2142,
                "longitude": -35.90824
            }
        }
    ],
    "CEEI": [
        {
            "acronym": "CEEI",
            "meaning": "Centro de Engenharia Elétrica e Informática. É o Centro responsável pelos Departamentos de Ciência da Computação e Engenharia Elétrica. É nele onde se situam as coordenações dos cursos de CC e EE.",
            "type": "Centro",
            "entry": "Centro de Engenharia Elétrica e Informática",
            "examples": [
                "Nesse campo \"Centro\" pode preencher CEEI, ou tem que ser por extenso?",
                "Tou indo lá no CEEI, ver se Fatinha tá na coordenação."
            ],
            "location": {
                "latitude": -7.213166,
                "longitude": -35.908628
            }
        }
    ],
    "CN": [
        {
            "meaning": "CN é o bloco que abriga o famoso LCC2, salas de projetos de diferentes laboratórios e também salas de professores do curso de Ciência da Computação da UFCG. Em frente ao CN tem um lindo e gigante Flamboyant (uma árvore que dá flores vermelhas em certas épocas do ano) e é o último dos blocos antes de chegar na 'florestinha/mato'.",
            "type": "Bloco",
            "entry": "CN",
            "examples": [
                "A professora Joseana disse que a sala dela é no CN.",
                "A secretária do DSC fica no CN."
            ],
            "location": {
                "latitude": -7.21333,
                "longitude": -35.90732
            }
        }
    ],
    "CP1": [
        {
            "meaning": "CP1 é o bloco mais recente do curso de Ciência da Computação da UFCG e é mais conhecido como 'o prédio do LCC3'. Nele estão localizados o LCC3, o PET do curso de Ciência da Computação da UFCG, o CAESI, a sala do ELAS, a sala da empresa júnior CodeX e futuramente salas que serão ocupadas para aulas e projetos.",
            "type": "Bloco",
            "entry": "CP1",
            "examples": [
                "A palestra da empresa X vai ser lá no CP1, o prédio do LCC3"
            ],
            "location": {
                "latitude": -7.2129,
                "longitude": -35.90748
            }
        }
    ],
    "Joab": [
        {
            "meaning": "Joab é como é conhecida a lanchonete mais próxima do CAA, fica bem ao lado da Xerox Amarelinha. Essa lanchonete é praticamente por trás do CAA e é muito frequentada por pessoas do curso de Ciência da Computação assim como por pessoas de outros cursos que se localizam majoritariamente no setor de exatas.",
            "type": "Lanchonete",
            "entry": "Joab",
            "examples": [
                "Te encontro lá em Joab quando acabar a aula",
                "Vamos tomar um café em Joab?"
            ],
            "location": {
                "latitude": -7.21395,
                "longitude": -35.90765
            }
        }
    ],
    "LAGUINHO": [
        {
            "meaning": "O Laguinho é o nome dado ao lago que se localiza entre os blocos A e C da UFCG, que surgiu através de projetos da própria instituição que consistiam em amenizar os impactos advindos das chuvas, além de ter o intuito de ser um local bonito e agradável para todos.",
            "type": "Ambiente de convivência",
            "entry": "Laguinho",
            "examples": [
                "Bora conversar lá nos bancos do laguinho?",
                "Vou comer lá no quiosque do laguinho, tu vai?"
            ],
            "location": {
                "latitude": -7.21484,
                "longitude": -35.90927
            }
        }
    ],
    "LCC1": [
        {
            "acronym": "LCC1",
            "meaning": "Laboratório de Ciência da Computação 1 é o laboratório mais antigo do curso de Ciência da Computação da UFCG e atualmente é usado principalmente para aulas em algumas disciplinas. Localiza-se no térreo do [REENGE](https://goo.gl/maps/RM26SXMW5tT2) (bloco CB).",
            "type": "Sala",
            "entry": "Laboratório de Ciência da Computação 1",
            "examples": [
                "O miniteste de amanhã será no LCC1!",
                "Pessoal, amanhã a nossa aula será no LCC1."
            ],
            "location": {
                "latitude": -7.21383,
                "longitude": -35.90899
            }
        }
    ],
    "LCC2": [
        {
            "acronym": "LCC2",
            "meaning": "Laboratório de Ciência da Computação 2 é o laboratório liberado para o uso dos alunos do curso de Ciência da Computação da UFCG nos horários em que não estiver tendo aula ou algum evento. Localiza-se no térreo do bloco CN.",
            "type": "Sala",
            "entry": "Laboratório de Ciência da Computação 2",
            "examples": [
                "Depois do almoço, vamos para o LCC2?",
                "Pessoal, amanhã a nossa aula será no LCC2."
            ],
            "location": {
                "latitude": -7.21339,
                "longitude": -35.9074
            }
        }
    ],
    "LCC3": [
        {
            "acronym": "LCC3",
            "meaning": "Laboratório de Ciência da Computação 3 é o laboratório mais recente do curso de Ciência da Computação da UFCG e é usado para aulas de diversas disciplinas. Localiza-se no segundo andar do Prédio Camilo Lélis (bloco CP1).",
            "type": "Sala",
            "entry": "Laboratório de Ciência da Computação 3",
            "examples": [
                "A sala do PET é no bloco do LCC3!",
                "Pessoal, amanhã a nossa aula será no LCC3."
            ],
            "location": {
                "latitude": -7.21289,
                "longitude": -35.90752
            }
        }
    ],
    "Quiosque": [
        {
            "meaning": "Quiosque é a lanchonete que fica ao lado do laguinho, não tem como errar, ela é a única ali. No Quiosque você encontra lanches e também é servido almoço.",
            "type": "Lanchonete",
            "entry": "Quiosque",
            "examples": [
                "Vou comer uma tapioca com café batido lá no Quiosque."
            ],
            "location": {
                "latitude": -7.21476,
                "longitude": -35.90896
            }
        }
    ]
}
