{
    "LCC1": [
        {
            "acronym": "LCC1",
            "meaning": "Laboratório de Ciência da Computação 1 é o laboratório mais antigo do curso de Ciência da Computação da UFCG e atualmente é usado principalmente para aulas em algumas disciplinas. Localiza-se no térreo do REENGE (bloco CB).",
            "type": "Sala",
            "entry": "Laboratório de Ciência da Computação 1",
            "examples": [
                "O miniteste de amanhã será no LCC1!",
                "Pessoal, amanhã a nossa aula será no LCC1."
            ]
        }
    ],
    "LCC2": [
        {
            "acronym": "LCC2",
            "meaning": "Laboratório de Ciência da Computação 2 é o laboratório liberado para o uso dos alunos do curso de Ciência da Computação da UFCG nos horários em que não estiver tendo aula ou algum evento. Localiza-se no térreo do bloco CN.",
            "type": "Sala",
            "entry": "Laboratório de Ciência da Computação 2",
            "examples": [
                "Depois do almoço, vamos para o LCC2?",
                "Pessoal, amanhã a nossa aula será no LCC2."
            ]
        }
    ],
    "LCC3": [
        {
            "acronym": "LCC3",
            "meaning": "Laboratório de Ciência da Computação 3 é o laboratório mais recente do curso de Ciência da Computação da UFCG e é usado para aulas de diversas disciplinas. Localiza-se no segundo andar do Prédio Camilo Lélis (bloco CP1).",
            "type": "Sala",
            "entry": "Laboratório de Ciência da Computação 3",
            "examples": [
                "A sala do PET é no bloco do LCC3!",
                "Pessoal, amanhã a nossa aula será no LCC3."
            ]
        }
    ],
    "CN": [
        {
            "meaning": "CN é o bloco que abriga o famoso LCC2, salas de projetos de diferentes laboratórios e também salas de professores do curso de Ciência da Computação da UFCG. Em frente ao CN tem um lindo e gigante Flamboyant (uma árvore que dá flores vermelhas em certas épocas do ano) e é o último dos blocos antes de chegar na 'florestinha/mato'.",
            "type": "Bloco",
            "entry": "CN",
            "examples": [
                "A professora Joseana disse que a sala dela é no CN.",
                "A secretária do DSC fica no CN."
            ]
        }
    ],
    "CP1": [
        {
            "meaning": "CP1 é o bloco mais recente do curso de Ciência da Computação da UFCG e é mais conhecido como 'o prédio do LCC3'. Nele estão localizados o LCC3, o PET do curso de Ciência da Computação da UFCG, o CAESI, a sala do ELAS, a sala da empresa júnior CodeX e futuramente salas que serão ocupadas para aulas e projetos.",
            "type": "Bloco",
            "entry": "CN",
            "examples": [
                "A palestra da empresa X vai ser lá no CP1, o prédio do LCC3"
            ]
        }
    ],
    "Joab": [
        {
            "meaning": "Joab é como é conhecida a lanchonete mais próxima do CAA, fica bem ao lado da Xerox Amarelinha. Essa lanchonete é praticamente atrás do CAA e é muito frequentada por pessoas do curso de Ciência da Computação assim como por pessoas de outros cursos que se localizam marjoritariamente no setor de exatas.",
            "type": "Bloco",
            "entry": "CN",
            "examples": [
                "A palestra da empresa X vai ser lá no CP1, o prédio do LCC3"
            ]
        }
    ]
}
