{
    "DSC": [
        {
            "acronym": "DSC",
            "meaning": "Departamento de Sistemas e Computação. É o Departamento da Universidade responsável pelo curso de Ciência da Computação.",
            "type": "Departamento",
            "entry": "Departamento de Sistemas e Computação",
            "examples": [
                "Tou indo na secretaria do DSC entregar o relatório da monitoria."
            ]
        }
    ],
    "PPC": [
        {
            "entry": "Projeto Pedagógico do Curso",
            "acronym": "PPC",
            "meaning": "Projeto Pedagógico do Curso. Se refere à estrutura das disciplinas do curso, como o período em que é recomendado cursar cada disciplina, os pré-requisitos, e similares. É importante ressaltar que em 2017/2018 o PPC foi alterado, dividindo os alunos em \"PPC Novo\" e \"PPC Antigo\". O uso desse termo apenas é coerente quando no contexto do curso de CC.",
            "type": "Termo",
            "examples": [
                "A gente tá no PCC novo ou antigo?",
                "Esse é o último período no PCC antigo, né?"
            ]
        }
    ],
    "RDM": [
        {
            "entry": "Relação de disciplinas matriculadas",
            "acronym": "RDM",
            "meaning": "A relação de disciplinas matriculadas é um documento emitido pela coordenação do curso ao ser realizada a matrícula das disciplinas no início do período. O RDM possui todas as disciplinas matriculadas e serve como comprovante de que você está vinculado à universidade.",
            "type": "Termo",
            "examples": [
                "Vou lá em Fatinha pedir meu RDM",
                "Fui lá na coordenação pegar meu histórico e RDM"
            ]
        }
    ],
    "SAD - Sistema": [
        {
            "entry": "Sistema de avaliação docente",
            "acronym": "SAD",
            "meaning": "É um sistema para avaliação docente, no qual os alunos que acabaram de cursasr a disciplina forneçam um feedback para aspectos como sistema de avaliação utilizado, se a disciplina seguiu a ementa, domínio do professor com relação ao conteúdo lecionado e, até mesmo, aspectos físicos, como a limpeza da sala, utilização de recursos digitais, etc. Tudo isso é feito através de notas de classificação e comentários. Não é obrigatório responder o SAD, mas é MUITO importante para melhorar a forma que a disciplina é conduzida, até porque, ao final, os professores recebem estas avaliações e adequam-as para o próximo semestre. Dessa maneira, se for o caso, deixem sugestões legais, críticas construtivas, elogios. Mas não precisa se preocupar, a avaliação é ANÔNIMA, ou seja, o professor não vai saber que foi você que escreveu aquele comentário ou atribuiu aquela nota. Ok, mas onde encontro o SAD? Calma o link de cada disciplina cursada é enviado ao final de cada período para seu e-mail.",
            "type": "Termo",
            "examples": [
                "Chegou e-mail do SAD.",
                "Já respondeu o SAD?"
            ]
        }
    ],
    "TECC": [
        {
            "entry": "Tópicos Especiais em Ciência da Computação",
            "acronym": "TECC",
            "meaning": "Tópicos Especiais em Ciência da Computação é um termo usado para disciplinas optativas específicas do curso de Ciência da Computação, como é o exemplo de [TECC] Jogos Digitais.",
            "type": "Termo",
            "examples": [
                "Você está matriculado em [TECC] Jogos Digitais"
            ]
        }
    ],
    "TST": [
        {
            "entry": "TST",
            "acronym": "TST",
            "meaning": "TST é uma ferramenta usada por professores em algumas disciplinas de ciência da computação para verificar e testar exercícios de programação dos alunos. Esta ferramenta pode ser usada na linha de comando como também existe um site com questões cadastradas.",
            "type": "Termo",
            "examples": [
                "Não consegui terminar todas as questões do TST de P1.",
                "Tentei a noite toda resolver aquela questão de TST mas fica dando erro nos testes.",
                "Aquela questão da prova de EDA tinha no TST."
            ]
        }
    ],
    "UASC": [
        {
            "acronym": "UASC",
            "meaning": "Unidade Acadêmica de Sistemas e Computação. Equivale ao DSC.",
            "type": "Departamento",
            "entry": "Unidade Acadêmica de Sistemas e Computação",
            "examples": [
                "A unidade acadêmica da gente é UASC ou DSC?"
            ]
        }
    ]
}
